<!--
 * @Description: k-loading
 * @Version: 1.0
 * @Author: 
 * @Date: 2024-03-04 14:28
 * @FilePath: /src/components/kLoading/kLoading.vue
-->
<template>
  <view class="loading bg-white tc w-full" :style="{ height: height }">
    <view class="img">
      <svg
        width="208px"
        height="55px"
        viewBox="0 0 208 55"
        xmlns="http://www.w3.org/2000/svg"
        xmlns:xlink="http://www.w3.org/1999/xlink"
      >
        <title />
        <g id="页面-1" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
          <g id="全屏-加载中备份" transform="translate(-271.000000, -898.000000)" fill="#F0F0F0" fill-rule="nonzero">
            <path
              id="微投研"
              d="M274.94,910.048 L289.152,906.628 L290.368,897.964 L276.156,901.384 L274.94,910.048 Z M333.764,952.608 L328.292,935.508 L334.448,922.74 L336.044,910.96 L337.868,910.96 L338.704,904.804 L328.444,904.804 L330.344,898.04 L321.224,898.04 L315.144,920.232 L324.112,920.232 L326.696,910.96 L328.52,910.96 L327.152,921.144 L325.1,925.324 L324.188,922.436 L315.296,922.436 L319.704,936.344 L311.724,952.532 L320.084,952.532 L322.972,946.604 L324.872,952.608 L333.764,952.608 Z M314.004,916.736 L316.056,901.992 L308.912,901.992 L307.696,910.732 L306.252,910.732 L308,898.116 L299.108,898.116 L300.4,900.244 L298.956,910.732 L297.512,910.732 L298.728,901.992 L291.736,901.992 L289.684,916.736 L314.004,916.736 Z M282.616,952.684 L287.48,918.18 L288.696,909.516 L274.56,912.936 L273.344,921.6 L275.624,921.068 L271.216,952.684 L282.616,952.684 Z M312.332,925.476 L313.244,918.712 L289.912,918.712 L289,925.476 L312.332,925.476 Z M310.356,952.076 L311.648,943.032 L309.064,944.932 L311.496,927.376 L288.772,927.376 L285.352,951.924 L294.548,951.924 L297.056,933.76 L301.616,933.76 L299.032,952.076 L310.356,952.076 Z M352.916,952.608 C354.334667,952.608 355.614,952.139333 356.754,951.202 C357.894,950.264667 358.565333,949.061333 358.768,947.592 L358.768,947.592 L361.124,930.796 L364.316,929.808 L365.456,921.752 L362.264,922.74 L363.556,913.848 L366.52,913.848 L367.584,906.628 L364.544,906.628 L365.76,898.04 L350.636,898.04 L352.536,900.244 L351.624,906.628 L346.684,906.628 L345.62,913.848 L350.636,913.848 L348.812,926.692 L343.644,928.212 L342.504,936.268 L347.672,934.748 L346.076,946.148 L340.148,952.608 L352.916,952.608 Z M380.504,919.776 L383.392,906.552 L394.564,906.552 L392.664,919.776 L408.016,919.776 L409.536,909.288 L406.952,912.176 L405.584,912.176 L407.408,899.408 L369.332,899.408 L371.688,902.144 L367.888,919.776 L380.504,919.776 Z M377.312,952.684 L383.24,948.656 L388.028,952.684 L404.064,952.684 L392.132,942.576 L404.672,934.064 L406.42,921.752 L367.888,921.752 L366.9,928.668 L391.448,928.668 L390.916,932.164 L384.76,936.344 L380.352,932.62 L380.58,930.644 L366.596,930.644 L366.14,934.064 L375.868,942.424 L360.82,952.684 L377.312,952.684 Z M449.436,952.684 L454.072,928.972 L458.86,928.972 L455.592,952.684 L467.296,952.684 L470.564,928.972 L475.048,928.972 L476.036,921.752 L471.628,921.752 L473.756,906.628 L477.252,906.628 L478.24,899.408 L444.344,899.408 L443.356,906.628 L446.776,906.628 L443.736,921.752 L440.164,921.752 L439.176,928.972 L442.292,928.972 L437.656,952.684 L449.436,952.684 Z M434.844,951.164 L439.632,917.04 L428.764,917.04 L432.488,907.464 L441,907.464 L442.14,899.56 L417.136,899.56 L415.996,907.464 L420.86,907.464 L411.284,931.936 L415.084,931.936 L412.424,951.164 L434.844,951.164 Z M459.924,921.752 L455.516,921.752 L458.556,906.628 L462.052,906.628 L459.924,921.752 Z M426.256,944.248 L423.216,944.248 L425.952,924.868 L428.992,924.868 L426.256,944.248 Z"
            />
          </g>
        </g>
      </svg>
    </view>
  </view>
</template>

<script>
import { defineComponent, reactive, toRefs } from 'vue';

export default defineComponent({
  name: 'KLoading',
  props: {
    /**
     * @description: 高度
     * @param
     * @author:
     */
    height: {
      type: [Number, String],
      default: 'calc(100vh - 120upx)',
    },
  },
  setup() {
    const state = reactive();
    return { ...toRefs(state) };
  },
});
</script>

<style lang="scss" scoped>
.loading {
  width: 100vw;
  position: absolute;
  display: flex;
  justify-content: center;
  align-items: center;
  z-index: 10;

  .img {
    background-color: #fff;

    svg {
      width: 208upx;
      height: 55upx;
      margin: 0 auto;
      overflow: hidden;
      position: relative;
    }

    svg::after {
      content: '';
      user-select: none;
      pointer-events: none;
      position: absolute;
      left: -150upx;
      top: 0;
      width: 30%;
      height: 100%;
      // background: -webkit-gradient(135deg, left top, right top, color-stop(0%, rgba(255,255,255,0)), color-stop(50%, rgba(255,255,255,.2)), color-stop(100%, rgba(255,255,255,0)));
      // background: -webkit-linear-gradient(135deg, rgba(255,255,255,0)0, rgba(255,255,255,.5)50%, rgba(255,255,255,0)100%); // 将闪烁区域变小

      background-image: linear-gradient(
        135deg,
        transparent 20%,
        rgb(255 255 255 / 50%) 50%,
        transparent 80%
      ); // 将闪烁区域变小

      background-size: 100% 100%;
      background-repeat: no-repeat;
      animation: mymove 1s linear infinite;

      /* Safari and Chrome */
      transition: left 5s ease 0s;
    }

    @keyframes mymove {
      from {
        left: 0;
      }

      to {
        left: 208upx;
      }
    }

    @keyframes mymove {
      from {
        left: 0;
      }

      to {
        left: 208upx;
      }
    }
  }
}
</style>
